# FamilyParameterSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameterSet Class
Members See Also
---
A set that contains FamilyParameter objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyParameterSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class FamilyParameterSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class FamilyParameterSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyParameterSet
# See Also
FamilyParameterSet Members
Autodesk.Revit.DB Namespace